
// О СТРУКТУРЕ ПАПОК
// Для каждого класса здесь создан отдельный проект - например, конфигурационные классы описаны в проекте config, а класс Main в проекте main
// Подобное разделение считается хорошим тоном

// О НЕЙМИНГЕ МЕТОДОВ
// Хорошим тоном считает использовать в нейминге глаголы, т.к методы что-то делают.
// но для бинов делаются некоторые исключения. Методы добавляющие бины в контекст спринг описывают экземпляры возвращаемых ими объектов, которые
//затем становятся частью контекста Spring и имя метода становится именем Бина.(по соглашению можно использовать существительные, которые совпадают с именем класса)

//